<a href="https://colab.research.google.com/github/klajosw/python/blob/master/kl_py_PandasMerge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p align="left"> 
    <img src="https://raw.githubusercontent.com/klajosw/python/master/kl_mie_python_logo_250.jpg" 
         align="left" width="251" height="251">
    
</p>


<p> </p>



# Python alapok 


## Pandas file i/o merge / JOIN és adat szűrések minta

Leírás: <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html/>

<https://klajosw.blogspot.com/>


---

In [0]:
# Import
import pandas as pd

In [0]:
## csv olvasás + írás
user = pd.read_csv('ugyfelcsv1.csv', header=None, nrows=5)  ## csv-ből olvasás, nincs fejlécsor, az első 5 sort
user                                                        ## megjelenítés
user.to_csv('ugyfelcsv1_kimenet.csv')                       ## csv-be mentés

In [0]:
## xls olvasás + írás
xlsx = pd.ExcelFile('telepules.xlsx')                      ## xls-ből olvasás
df = pd.read_excel(xlsx,  'telepules')                     ## aktív munkalap kijelőlése
df                                                         ## megjelenítés
df.to_excel('telepules_kimenet.xlsx',  sheet_name='Tel')   ## xls-be mentés

In [0]:
print('Sor, oszlop szám' ,df.shape)  ## sor és oszlopszám kiírása
print('index', df.index)
print('Oszlop nevek', df.columns)
print('ifo',df.info())
print('count',df.count())
print('cumsum', df.cumsum())
print('describe',df.describe())

Sor, oszlop szám (3176, 2)
index RangeIndex(start=0, stop=3176, step=1)
Oszlop nevek Index(['helyseg', 'lakos'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3176 entries, 0 to 3175
Data columns (total 2 columns):
helyseg    3176 non-null object
lakos      3176 non-null int64
dtypes: int64(1), object(1)
memory usage: 49.8+ KB
ifo None
count helyseg    3176
lakos      3176
dtype: int64
cumsum                                                 helyseg    lakos
0                                              Debrecen   204333
1                                       DebrecenMiskolc   367238
2                                 DebrecenMiskolcSzeged   529075
3                             DebrecenMiskolcSzegedPécs   676794
4            DebrecenMiskolcSzegedPécsBudapest 11. ker.   821393
...                                                 ...      ...
3171  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908747
3172  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908762
3173  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908776
3174  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908789
3175  DebrecenMiskolcSzegedPécsBudapest 11. ker.Győr...  9908798

[3176 rows x 2 columns]
describe                lakos
count    3176.000000
mean     3119.898615
std     11263.585339
min         9.000000
25%       345.750000
50%       837.000000
75%      1965.250000
max    204333.000000

In [0]:
# df.rank()
df.sort_values(by='lakos') 
df[df['lakos']>10000000]
print(df[1:3])
print('-----------')
print(df.loc[4][0])
print('-----------')
print(df.iloc[2])
print('-----------')
print(df.loc[3][0])

   helyseg   lakos
1  Miskolc  162905
2   Szeged  161837
-----------
Budapest 11. ker.
-----------
helyseg    Szeged
lakos      161837
Name: 2, dtype: object
-----------
Pécs

In [0]:
## Text állományok megnyítása (csv: ,)
user_1 = pd.read_csv("ugyfelcsv1.csv")
user_2 = pd.read_csv("ugyfelcsv2.csv")

In [0]:
# user = pd.read_csv('ugyfelcsv11.txt', sep='\t', lineterminator='\r')  ## TAB szeperát
user = pd.read_csv('ugyfelcsv11.txt', sep=';', lineterminator='\r')  ## pontosvesszővel szeperát
user

   ugyfel_id       vnev       knev     szdatum nem
0          1     Walter  Gwendolyn  1954-07-10   M
1          2  Armstrong     Kieran  1932-02-24   M
2          3      Kline      Silas  1938-07-16   M
3          4  Gallagher      Rhoda  1972-10-28   M
4          5  Gallagher      Robin  1940-02-02   M
5          6      Frank      Blair  1977-12-19   M
6          7       Cash    Vaughan  1989-04-06   M
7          8    Shields   Charissa  1926-03-25   F
8          9      Brown       Inga  1942-04-18   F
9         10   Crawford     Glenna  1969-05-14   F

In [0]:
# user_1.head()  # csak első négy sor megjelenítése
user_1

   ugyfel_id       vnev       knev     szdatum nem
0          1     Walter  Gwendolyn  1954-07-10   M
1          2  Armstrong     Kieran  1932-02-24   M
2          3      Kline      Silas  1938-07-16   M
3          4  Gallagher      Rhoda  1972-10-28   M
4          5  Gallagher      Robin  1940-02-02   M
5          6      Frank      Blair  1977-12-19   M
6          7       Cash    Vaughan  1989-04-06   M
7          8    Shields   Charissa  1926-03-25   F
8          9      Brown       Inga  1942-04-18   F
9         10   Crawford     Glenna  1969-05-14   F

In [0]:
## charset beállítás utánni megnyítás
import codecs
doc = codecs.open('ugyfelcsv11.txt','rU','UTF-8') ## open for reading with "universal" type set
user_1 = pd.read_csv(doc, sep=';')
user_1

   ugyfel_id       vnev       knev     szdatum nem
0          1     Walter  Gwendolyn  1954-07-10   M
1          2  Armstrong     Kieran  1932-02-24   M
2          3      Kline      Silas  1938-07-16   M
3          4  Gallagher      Rhoda  1972-10-28   M
4          5  Gallagher      Robin  1940-02-02   M
5          6      Frank      Blair  1977-12-19   M
6          7       Cash    Vaughan  1989-04-06   M
7          8    Shields   Charissa  1926-03-25   F
8          9      Brown       Inga  1942-04-18   F
9         10   Crawford     Glenna  1969-05-14   F

In [0]:
# user_dada.rename(columns={"ugyfel_id": "ID"}, inplace=True)  ## fejléc átnevezése, ha szükséges lenne
# user_2.head()  ## csak elsőnégy sor 
user_2

   ugyfel_id igazolvanytipus_id igazolvanyszam
0          3                  J       YLHVLF29
1          4                  J       SIDNEE06
2          5                 SZ       DUSUNF64
3          6                 UL       ENBNYK36
4          7                 UL       PFOTXW50
5          8                  J       MMRDLZ25
6          9                 SZ       SKCMWG34
7         10                 UL       VUKMBG65
8         11                 SZ       NCGJMG03
9         12                 SZ       LZQSRL48

In [0]:
# user_id.rename(columns={"ugyfel_id": "ID"}, inplace=True)
user_id.head(10)

   ugyfel_id igazolvanytipus_id igazolvanyszam
0          1                 SZ       NCGJMG03
1          2                 SZ       LZQSRL48
2          3                  J       YLHVLF29
3          4                  J       SIDNEE06
4          5                 SZ       DUSUNF64
5          6                 UL       ENBNYK36
6          7                 UL       PFOTXW50
7          8                  J       MMRDLZ25
8          9                 SZ       SKCMWG34
9         10                 UL       VUKMBG65

---

## Két forrás tartalmának összekapcsolása 1.

Kapcsolás az `ugyfel_id` kulcs mező szerint történik

---

In [0]:
result = pd.merge(user_1,
                 user_2[['ugyfel_id', 'igazolvanyszam']], ## hozzáfűzési mezők, az első a kulcs mező
                 on='ugyfel_id',                          ## kulcs mező a kapcsoláshoz (azonos nevüek legyenek)
                 how='left',                              ## Kapcsolat módja (left, right, outer, inner)
                 indicator=True                           ## jelző újmezőben megjelenítése                   
                 )
result.head(10)

   ugyfel_id       vnev       knev     szdatum nem igazolvanyszam     _merge
0          1     Walter  Gwendolyn  1954-07-10   M            NaN  left_only
1          2  Armstrong     Kieran  1932-02-24   M            NaN  left_only
2          3      Kline      Silas  1938-07-16   M       YLHVLF29       both
3          4  Gallagher      Rhoda  1972-10-28   M       SIDNEE06       both
4          5  Gallagher      Robin  1940-02-02   M       DUSUNF64       both
5          6      Frank      Blair  1977-12-19   M       ENBNYK36       both
6          7       Cash    Vaughan  1989-04-06   M       PFOTXW50       both
7          8    Shields   Charissa  1926-03-25   F       MMRDLZ25       both
8          9      Brown       Inga  1942-04-18   F       SKCMWG34       both
9         10   Crawford     Glenna  1969-05-14   F       VUKMBG65       both

Nézzük egy érték vizsgálatot.

In [0]:
print("user_1 shape: {}".format(user_1.shape))
print("user_2 shape: {}".format(user_2.shape))

user_1 dimensions: (10, 5)
user_2 dimensions: (10, 3)

In [0]:
# Azonositó benn foglalás ellenőrzése
user_1['ugyfel_id'].isin(user_2['ugyfel_id']).value_counts()

True     8
False    2
Name: ugyfel_id, dtype: int64

---

## Két forrás tartalmának összekapcsolása 2.

Kapcsolás az `ugyfel_id` kulcs mező szerint történik, de itt korréten megadjuk a kapcsolódo mezők nevét.

---

In [0]:
result = pd.merge(user_1,
                 user_2[['igazolvanytipus_id', 'ugyfel_id']], ## hozzáfűzési mezők // nem szerepel az első a kulcs mező
                 left_on='ugyfel_id', right_on='ugyfel_id',   ## kulcs mezők konkrét megadása a kapcsoláshoz (eltérő nevüek)
                 how='outer',                                 ## Kapcsolat módja left
                 indicator=True                               ## jelző újmezőben megjelenítése                   
                 )
result.head(12)                                               ## első 12 sor megjelenítése (most összesen ennyi van)

,ugyfel_id,vnev,knev,szdatum,nem,igazolvanytipus_id,_merge
0,1,Walter,Gwendolyn,1954-07-10,M,NaN,left_only
1,2,Armstrong,Kieran,1932-02-24,M,NaN,left_only
2,3,Kline,Silas,1938-07-16,M,J,both
3,4,Gallagher,Rhoda,1972-10-28,M,J,both
4,5,Gallagher,Robin,1940-02-02,M,SZ,both
5,6,Frank,Blair,1977-12-19,M,UL,both
6,7,Cash,Vaughan,1989-04-06,M,UL,both
7,8,Shields,Charissa,1926-03-25,F,J,both
8,9,Brown,Inga,1942-04-18,F,SZ,both
9,10,Crawford,Glenna,1969-05-14,F,UL,both
10,11,NaN,NaN,NaN,NaN,SZ,right_only
11,12,NaN,NaN,NaN,NaN,SZ,right_only

---
## Adatszámlálások


---

In [0]:
print("Összesen van {} sorunk, amelyben nem szerepel egy oszlopban sem nulla.".format(
    (result.apply(lambda x: x.isnull().sum(), axis=1) == 0).sum()))
print("Hiányzó adat {} szor fordul elő az 'igazolvanytipus_id' mezőben.".format(
        result['igazolvanytipus_id'].isnull().sum()))

Összesen van 8 sorunk, amelyben nem szerepel egy oszlopban sem nulla.
Hiányzó adat 2 szor fordul elő az 'igazolvanytipus_id' mezőben.

---

## A szűrések

---

In [0]:
user_1[user_1.nem == 'F'] ## Nők megjelenitése csak azok amelyek a nem mezőben F -et tartalmaznak

   ugyfel_id      vnev      knev     szdatum nem
7          8   Shields  Charissa  1926-03-25   F
8          9     Brown      Inga  1942-04-18   F
9         10  Crawford    Glenna  1969-05-14   F

In [0]:
user_1[user_1.vnev.str.startswith('Ga')]  ## Ga vnev kezdettel rendelkezők listázása

   ugyfel_id       vnev   knev     szdatum nem
3          4  Gallagher  Rhoda  1972-10-28   M
4          5  Gallagher  Robin  1940-02-02   M

---

## Statisztikai függvények használata

---

In [0]:
## Hányan vannak a nők és a férfiak és milyen idősek a legfiatalabbak
user_1.groupby("nem").agg({
        "szdatum": "min",  ## mean, max, ..
        "knev": "count"
    })

        szdatum  knev
nem
F    1926-03-25     3
M    1932-02-24     7